terraform plan from this branch AFTER creating on main branch:

```hcl
# module.slz_vsi.ibm_is_instance.vsi["slz-vsi-001"] will be created
  + resource "ibm_is_instance" "vsi" {
      + access_tags                       = (known after apply)
      + availability_policy_host_failure  = (known after apply)
      + bandwidth                         = (known after apply)
      + crn                               = (known after apply)
      + default_trusted_profile_auto_link = (known after apply)
      + disks                             = (known after apply)
      + force_action                      = false
```

So actually it is getting destroyed and recreated because the name in the map changes. This has nothing to do with the provider. Terraform sees it as a new different map entries.

This adds a whole new dimension. The point of the PR appears to be that the resources created have different names. Therefor can we keep the internal names module.slz_vsi.ibm_is_instance.vsi["slz-vsi-1"] as a reference to `vsi.name: "slz-vsi-001"`? Or is that just even more confusing?